<template>
  <div onselectstart="return false" class="registerProvision">
    <header>
      <router-link v-if='source' to='/setting/legalProvision'><img src="../../../assets/ic_back_1.png"></router-link>
      <span @click="back" v-if='!source'><img src="../../../assets/ic_back_1.png"></span>
      <div>{{title}}</div>
    </header>
    <div class="list">
      <div class="register-pro">
        <div class="shuiyin">
          <img src="../../../assets/shuiyin.png" alt="">
          <img src="../../../assets/shuiyin.png" alt="">
          <img src="../../../assets/shuiyin.png" alt="">
        </div>
        尊敬的用户：
        <p>您好！请您在使用西客前仔细阅读以下法律声明。。</p>
        <p>
          西客（本声明项下西客均包含：西客软件、西客开放平台等）由准道网络科技（上海）有限公司（下称：准道公司）开发创建并维护。用户进入并使用西客，接受西客提供的服务，视同用户已知晓并接受下列法律声明中包含的全部条款，这些条款同时构成准道公司与用户之间的协议，自用户使用西客之日起生效。倘不同意下列条款，请勿使用西客。准道公司有权随时修改本法律声明的内容。修改后的法律声明一经在西客公布，即对用户具有约束力。用户继续使用西客，视为接受修改后的法律声明。</p>
        <br>
        【免责声明】
        <p>
          一、西客在国家相关法律法规规定的范围内，为用户发布配送信息的第三方网络平台服务，西客及其所有者并非交易一方，也非交易任何一方之代理人或代表；同时，西客及准道公司也未授权任何人代表或代理西客及其所有者从事任何网络交易行为或做出任何承诺、保证或其他类似行为，除非有明确的书面授权。</p>
        <p>
          二、鉴于互联网及网络交易的特殊性，西客无法鉴别和判断相关交易各主体之民事权利和行为能力、资质、信用等状况，也无法鉴别和判断虚拟交易或正在交易或已交易之虚拟物品来源、权属、真伪、性能、规格、质量、数量等权利属性、自然属性及其他各种状况。因此，交易各方在交易前应加以仔细辨明，并慎重考虑和评估交易可能产生的各项风险。</p>
        <p>
          三、用户同意，并充分理解西客仅是发布配送服务信息的中介网络平台，以通过共享信息资源、报告交易机会、辅助交易用户提供相关交易信息资料（例如用户需配送物品的取件地点、送达地点、货物重量、服务费用）等形式，促成用户与配送人员之间的合同成立，并收取一定的手续服务费。</p>
        <p>四、用户同意，并充分理解准道公司不是配送服务的交易的一方，不对用户间的交易负责，由此产生的纠纷由用户自行处理，与准道公司无关。</p>
        <p>
          五、准道公司不希望用户之间及用户与配送人员之间产生任何纠纷，但并不保证不发生该类纠纷。如产生前述纠纷，准道会努力协助用户解决。如无法协商处理的，交易各方可依据现行有效的法律提交有权机关或机构进行处理，准道及其所有者不参与其中；对前述纠纷之任何责任和后果，由交易各方承担，与准道公司无关。</p>
        <p>
          六、准道公司保证对交易过程中涉及到的交易信息资料进行保密，且不对任何非交易方的第三方透露。但是，如因用户或第三方的原因（包括但不限于黑客攻击、计算机病毒入侵、因政府管制造成的暂时性关闭、互联网接入提供商原因、电信管理部门的原因等）导致泄密，准道公司不承担任何责任。同时，当政府部门或司法部门依照法定程序要求披露相关个人资料及交易信息，准道依法予以披露也不担责。</p>
        <p>七、如因系统维护或升级而需暂停服务时，准道公司将事先公告。如因线路及准道公司控制范围外的硬件故障或其他不可抗力原因而导致暂停服务，准道公司对由此产生的不便或损失不承担任何责任。</p>
        <p>
          八、西客不希望出现任何人利用西客或因使用西客而侵犯他人合法权益的行为，但并不保证不会发生此类行为或类似行为。西客将依据中国法律采取必要的措施防止发生前述各类行为或降低发生这类行为的可能性或者降低由此造成的损失及其后果。对于因前述各类情形而产生的任何纠纷，将由权利受到侵害之人和侵权方依据中华人民共和国现行的有关法律通过适当的方式直接加以解决，西客及准道公司不参与其中；对于因此类行为产生的各类纠纷之任何责任和后果，由相关责任方承担，西客及准道公司不承担任何责任及后果。</p>
        <p>九、任何非西客责任而产生的任何其他纠纷，概由纠纷各方依据中国相关法律以适当的方式直接加以解决，西客不参与其中；对于因该类行为产生的各类纠纷之任何责任和后果，由相关各方承担，西客及准道公司不承担任何责任及后果。</p>
        <br>
        【第三方链接】
        <p>西客可能包含由第三方设立与维护的网站/网页链接。西客对第三方网站/网页的链接行为，不代表准道公司认可第三方网站/网页的内容，亦不代表准道公司承担因用户进入第三方网站/网页引发的法律责任。</p>
        <p>准道公司建议用户谨慎进入其他网站/网页以免遭受病毒或其他破坏性程序的侵害。用户选择访问西客链接的第三方网站/网页的，视为用户知晓并愿意自行承担相应风险。</p>
        <br>
        【禁止行为】
        <p>
          用户不得在西客发表违反国家法律的言论，不得发表包含种族、肤色、性别、性取向、宗教、民族、地域、残疾、社会经济状况歧视内容的言论，不得发表侮辱、诽谤他人的言论，不得发表损害他人商业信誉的言论，不得发表宣扬邪教、色情、淫秽、暴力、迷信、教唆犯罪的言论。</p>
        <p>用户不得在西客从事任何可能侵害他人知识产权的行为，包括但不限于侵犯他人专利、著作权、商标专用权、技术秘密、商业秘密。</p>
        <p>用户利用西客从事上述活动的，准道公司有权立即删除用户发布的信息，并有权立即终止对其的服务且无需承担任何责任。</p>
        <br>
        【特别提示】
        <p>侵入计算机信息系统、通过非法手段获取他人计算机信息系统中的数据或对系统实施非法控制等行为，可能涉及刑事犯罪。通过网络平台发布虚假信息，骗取他人财物的行为，可能涉及刑事犯罪。</p>
        <p>准道公司将对出现在西客上的违法犯罪行为进行干预与制止，并依法协助国家有关部门进行必要的调查与处置。用户利用西客实施任何违法犯罪活动的，准道公司有权立即终止对其的服务且无需承担任何责任。</p>
        <p>准道公司依法干预与制止网络违法犯罪的举动，用户理解并愿意提供必要的协助；在干预与制止违法犯罪的过程中对用户造成的影响，用户自愿放弃索赔权利。</p>
        <br>
        【法律适用与管辖】
        <p>西客及本法律声明适用中华人民共和国法律。任何因使用西客发生的争议，或因本法律声明引发的争议，均由准道公司之住所地人民法院管辖。</p>


      </div>
    </div>
  </div>
</template>

<script>
  import {isiOS} from '../../../../static/js/index.js'

  export default {
    name: 'registerProvision',
    data () {
      return {
        title: '注册协议',
        source: true
      }
    },
    methods: {
      back () {
        //返回键（左上角）
        if (isiOS) {
          window.webkit.messageHandlers.onBaackPress.postMessage(null);
        }else{
          window.gidoorJS.onBaackPress();
        }
      }
    },
    mounted () {
      //当地址栏参数为1时,执行返回操作
      if (this.$route.params.name == 1) {
        this.source = false;
      }
    }
  }
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
  .register-pro {
    margin: 20px;
    position: relative;
  }

  .shuiyin {
    position: absolute;
    left: 0;
    top: 0;
    z-index: -1;
  }

  .shuiyin img {
    width: 100%;
    margin: 300px 0 200px 0;
  }

  p {
    text-indent: 4ex;
    margin: 0;
    letter-spacing: 2px;
  }
</style>
