<template>
  <div onselectstart="return false" class="serviceProvision">
    <header>
      <router-link v-if='source' to='/setting/legalProvision'><img src="../../../assets/ic_back_1.png"></router-link>
      <span @click="back" v-if='!source'><img src="../../../assets/ic_back_1.png"></span>
      <div>{{title}}</div>
    </header>
    <div class="list">
      <div class="register-pro">
        <div class="shuiyin">
          <img src="../../../assets/shuiyin.png" alt="">
          <img src="../../../assets/shuiyin.png" alt="">
          <img src="../../../assets/shuiyin.png" alt="">
          <img src="../../../assets/shuiyin.png" alt="">
        </div>
        <p>当您在准道网络科技（上海）有限公司（以下简称“准道公司”）开发的西客应用软件（以下简称“西客”）上进行西客注册之前，您应当仔细阅读本服务条款。本服务条款将成为您和准道公司之间具有法律效力的文件。</p>
        <p>1、西客注册用户应为年满18周岁且具备完全民事行为能力的自然人。</p>
        <p>2、西客注册用户完成注册并经西客和/或准道公司审核通过后，可以通过西客软件发布配送任务信息，并支付相应的配送费用。</p>
        <p>
          3、“西客”软件作为信息发布、服务平台，仅为平台上的用户提供信息服务，供用户自主选择发布、接受任务事项信息。准道公司不对任务事项信息的真实性或准确性及所涉物品的质量、安全或合法性等提供担保。您应自行谨慎判断确定相关信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。用户对本平台上任何信息资料的发布、选择、接受，取决于用户自己并由其自行承担所有风险和责任。</p>
        <p>4、请您仔细阅读本条款，您成功申请成为西客用户后，本条款即构成了对双方具有法律约束力的文件。</p>
        <br>
        <h4>服务模式：</h4>
        <p>1、西客注册用户申请注册、按照西客要求提供相关证明文件并经西客和准道平台审核通过后，即可通过手机等终端自主发布配送任务信息，并支付相应的配送费用。</p>
        <p>
          2、西客注册用户在西客信息平台上发布的订单任务事项。西客注册用户承诺：发布任务事项信息均为真实准确的；西客注册用户的人身及财产安全由西客注册用户自行负责并承担全部责任；因西客注册用户原因造成任何第三方人身、财产损失或侵害第三方合法权益的，西客注册用户应妥善处理纠纷并承担全部赔偿责任。</p>
        <h4>注册有效期限：</h4>
        <p>3、本注册协议从西客注册用户资格审核通过之日起至西客注册用户资格被主动放弃、终止、丧失或西客注册协议解除或终止之日止。</p>
        <h4>西客注册用户费用支付：</h4>
        <p>4、西客注册用户通过西客发布配送任务事项并立即支付该任务事项对应的服务费，配送人员收到订单并及时有效完成配送任务。</p>
        <p>5、西客注册用户发布订单的服务费，将通过西客内的线上支付功能支付。</p>
        <h4>西客用户注册申请条件：</h4>
        <p>6、年满十八周岁且具有完全民事行为能力。</p>
        <p>7、应遵守国家有关法律法规、部门规章等和西客软件的全部管理规定。</p>
        <p>
          8、对本次注册所提供的信息和今后发布的任务信息得真实性承担法律责任。用户不得在西客发表违反国家法律的言论，不得发表包含种族、肤色、性别、性取向、宗教、民族、地域、残疾、社会经济状况歧视内容的言论，不得发表侮辱、诽谤他人的言论，不得发表损害他人商业信誉的言论，不得发表宣扬邪教、色情、淫秽、暴力、迷信、教唆犯罪的言论。</p>
        <p>
          9、用户不得在西客从事任何可能侵害他人知识产权的行为，包括但不限于侵犯他人专利、著作权、商标专用权、技术秘密、商业秘密。不得利用西客从事任何违法犯罪的活动，准道公司有权将用户任何的违法行为报告给相关司法机关及管理部门，同时有权视情节轻重暂停直至注销相关人员的西客用户资格。</p>
        <p>10、西客注册用户同意准道平台对其提供的信息资料进行统一管理，并用于业务统计等用途；准道平台有权对西客注册用户的服务进行监督，并决定是否暂停、注销西客账户，取消西客用户资格。</p>
        <p>
          11、对在合作过程中知悉的准道公司的商业信息、用户和配送人员的个人信息进行保密，西客注册用户不得阅览、复印、摘抄或以其他方式传播、披露、泄露，自行或允许他人为西客之外的用途使用，由此造成的任何不利后果，准道公司及相关权利人都将追究其法律责任。</p>
        <p>
          12、禁止西客注册用户个人或伙同他人以欺诈的方式获取准道平台给予的各种补贴、扶持政策、商业利益等，西客注册用户获得的任何补贴、扶持政策和商业利益，均以准道公司的相关公告和活动规定为准，否则，准道公司有权没收该部分违法或违规所得，注销西客用户资格，并追究行为人的法律责任。</p>
        <h4>其他内容：</h4>
        <p>
          13、本条款内容包括协议正文、附件及所有准道公司已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，在享受任何准道公司及其关联公司基于服务平台提供的服务时，您均须受本协议约束。您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用信息平台的服务。</p>
        <p>14、准道公司有权根据国家法律法规的更新、产品和服务规则的调整需要不时地制订、修改本条款或各类规则，并以准道公司、西客软件或网站公示的方式进行公示。如您继续使用信息平台的服务的，即表示您接受经修订的协议和规则。</p>
        <p>15、西客提供的服务为：搭建、提供及维护信息发布；为西客注册用户提供信息中介和管理服务，并设计、开发信息服务产品。</p>
        <p>
          16、西客注册用户应自行向西客提供相应资料，西客注册用户保证其使用时提供的资料真实、准确、完整、合法有效。西客注册用户信息资料如有变动的，应及时更新。如果西客注册用户提供的资料信息不合法、不真实、不准确、不详尽的，需承担因此引起的相应责任及后果，并且准道公司保留终止其使用本服务平台各项服务的权利。</p>
        <p>
          17、西客注册用户明确同意对网络服务的使用承担风险。准道公司对此无法作任何类型的担保。包括：不担保服务一定能满足用户的要求，也不担保服务不会受中断，对服务的及时性，安全性，出错发生都不作担保；对在西客上以及相关产品得到的任何服务或交易进程，不作担保；对西客所涉及的技术及信息的有效性、准确性、正确性、可靠性、稳定性、完整性和及时性无法作出任何承诺和保证；不担保西客服务的适用性、没有错误或疏漏、持续性、准确性、可靠性或适用于某一特定用途。用户理解并接受：西客服务平台作为信息发布、服务平台，无法控制每一任务事项所涉及的物品的质量、安全或合法性，任务事项内容的真实性或准确性，以及任务事项所涉各方履行任务事项的能力。您应自行谨慎判断确定相关信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。</p>
        <p>18.1在西客上发布的每一任务订单，都有对应的服务费收费标准，您发布任务订单就表明您认可此订单的服务费并有能力支付服务费。</p>
        <p>18.2用户通过西客内的线上支付功能支付订单服务费。您应现场核对服务费用的支付是否准确，由此造成的任何争议由您自行承担，准道公司不承担责任。</p>
        <p>19.西客注册用户了解并同意，准道公司不对因下述情况而导致的任何损害赔偿承担责任，包括但不限于利润、商誉、数据、物品丢失等方面的损失或其它无形损失的损害赔偿：</p>
        <p>20.3您完成服务并经消费者及准道公司确认后，您可以按照佣兵APP规定的提取规则对账户提现。</p>
        <p>（1）使用或未能使用服务平台的服务；</p>
        <p>（2）第三方未经批准地使用用户的账户或更改用户的数据；</p>
        <p>（3）配送人员配送服务迟延、配送物品丢失而产生的损失；</p>
        <p>（4）用户对服务平台的信息发布服务的误解；</p>
        <p>（5）任何非因准道公司的原因而引起的与服务平台的服务有关的其它损失。</p>
        <p>
          20、如因不可抗力或其他准道公司无法控制的原因使服务平台崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，准道公司不承担责任。但是准道公司会尽可能合理地协助处理善后事宜，并努力使软件使用者免受经济损失。</p>
        <p>21、西客注册用户同意在发现服务平台任何内容不符合法律规定，或不符合本用户协议条款规定的，有义务及时通知准道公司。</p>
        <p>22、您了解并同意：</p>
        <p>（1）违反上述承诺时，准道公司有权依据本协议的约定，做出相应处理或终止向您提供服务，且无须征得您的同意或提前通知予您；</p>
        <p>（2）根据相关法律的指定或者服务平台规则的判断，您的行为涉嫌违反法律法规的规定或违反本协议和/或规则的条款的，准道公司有权采取相应措施，包括但不限于直接屏蔽、删除侵权信息或直接停止提供服务。</p>
        <p>23、本服务条款的订立、执行和解释及争议的解决均适用中国法律。如双方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向准道公司所在地有管辖权的人民法院提起诉讼。</p>
        <p>24、本服务条款由准道公司负责解释和阐明。</p>
      </div>
    </div>
  </div>
</template>

<script>
  import {isiOS} from '../../../../static/js/index.js'

  export default {
    name: 'serviceProvision',
    data () {
      return {
        title: '服务协议',
        source: true
      }
    },
    methods: {
      back () {
        //返回键（左上角）
        if (isiOS) {
          window.webkit.messageHandlers.onBaackPress.postMessage(null);
        }else{
          window.gidoorJS.onBaackPress();
        }
      }
    },
    mounted (source) {
      //当地址栏参数为1时,执行返回操作
      if (this.$route.params.name == 1) {
        this.source = false;
      }
    }

  }
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
  .register-pro {
    margin: 20px;
    position: relative;
  }

  .shuiyin {
    position: absolute;
    left: 0;
    top: 0;
    z-index: -1;
  }

  .shuiyin img {
    width: 100%;
    margin: 300px 0 200px 0;
  }

  p {
    text-indent: 4ex;
    margin: 2px 0;
    letter-spacing: 2px;
  }

  h4 {
    padding: 0;
    margin: 5px 0;
  }

</style>
